# CHANGELOG v0.2

## Back-end
- Улучшен способ хранения и обработки данных
- Улучшена интеграция с мегапланом
	- Уменьшение зависимости приложения от мегаплана
	- Конфигурация поведения через .env файл
	- Изменено поведение статусов: добавлен статус "создано", и статус меняется на "назначена", только после переназначения задачи на другого ответственного
	- Улучшена стабильность получения событий от мегаплана
- Добавлена возможность контейнеризации приложения через Docker для конфигурации и установки на виртуальных машинах
- Добавлена возможность получать уведомления от приложения в реальном времени через Telegram
	- Авторизация по уникальному ключу
- Улучшен API 
	- Авторизация все так же по IP адресу устройства, только теперь используется JWT токен, который используется для идентификации при каждом запросе к API
	- API разделен на 2 части:
		1. Пользовательский API, используется пользователем веб-интерфейса, для выполнения основного доступного функционала
		2. Администратор API, используется администратором в админ веб-интерфейсе, для полного управления данных приложения
	- Добавлена возможность комментировать задачи
		- Комментарии попадают в мегаплан с тэгом "#[FROMUSER]: ..."
		- Комментарии могут быть отправлены из мегаплана используя тэг "#[TOUSER]: ..."
		- Есть возможность комментировать без мегаплана
	- Пересмотрена структура данных
		- Пользователю добавлена возможность видеть свои задачи, задачи отдела и задачи всей компании
		- Пользователю добавлена возможность комментировать все доступные ему задачи (Требует дальнейшего рассмотрения)

## Front-end
- Собрана библиотека UI компонентов для разработки интерфейса
- Улучшен UX пользователя
	- Обратная связь при взаимодействии с интерфейсом
	- Быстрая загрузка страниц приложения
	- Бесшовные переходы между страницами
- Добавлена страница профиля пользователя
	- Отображение статистики текущих задач пользователя
	- Добавлена возможность подключения уведомлений в Telegram и просмотр уникального ключа для авторизации
- Добавлена возможность просмотра задач отдела и задач компании во вкладке Обращения
	- На задачах отдела и компании отображается постановщик задачи
- Добавлена страница чата задачи
	- При нажатии на задачу, пользователь попадает в чат с технической поддержкой, где может отправлять сообщения
	- Сообщения от других пользователей отображаются с другой стороны и с указанием имени отправителя
